address_dict = {
    "Братьев Кашириных, 130 А": {
        "Координаты": [55.173164, 61.300406],
        "Заведующий": "Абдалов Абдал Гусейн Оглы",
        "Участки": {
            1: {
                "ФИО врача": "Максютова Лидия Абзаловна",
                "Адреса": [
                    "250-летия челябинск 25", "250-летия челябинск 25а",
                    "салавата юлаева 23", "салавата юлаева 23а",
                    "салавата юлаева 25", "салавата юлаева 25б",
                    "салавата юлаева 29", "салавата юлаева 29а"
                ]
            },
            2: {
                "ФИО врача": "Белоброва Кристина Евгеньевна",
                "Адреса": [
                    "братьев кашириных 132", "братьев кашириных 132а",
                    "братьев кашириных 134", "братьев кашириных 134а",
                    "братьев кашириных 136", "братьев кашириных 136а",
                    "братьев кашириных 138", "братьев кашириных 112", "братьев кашириных 118",
                    "чичерина 38в", "чичерина 40в", "чичерина 42б"
                ]
            },
            3: {
                "ФИО врача": "Зюзина Ирина Владимировна",
                "Адреса": [
                    "250-летия челябинска 19", "250-летия челябинска 21", "250-летия челябинска 21а",
                    "250-летия челябинска 23", "250-летия челябинска 23а",
                    "чичерина 38", "чичерина 38а", "чичерина 38б", "чичерина 40", "чичерина 42",
                    "чичерина 42а", "чичерина 44"
                ]
            },
            4: {
                "ФИО врача": "Мыльникова Ксения Евгеньевна",
                "Адреса": [
                    "250-летия челябинска 15а", "250-летия челябинска 17", "250-летия челябинска 17б",
                    "чичерина 31", "чичерина 33", "чичерина 33а", "чичерина 33в", "чичерина 35",
                    "чичерина 35а", "чичерина 35б", "чичерина 37", "чичерина 37а"
                ]
            },
            21: {
                "ФИО врача": "Мансуров Денис Булякбаевич",
                "Адреса": [
                    "250-летия челябинска 13", "250-летия челябинска 13а",
                    "40 лет победы 36", "40 лет победы 36а", "40 лет победы 36в",
                    "40 лет победы 38", "40 лет победы 38а", "40 лет победы 38б"
                ]
            },
            24: {
                "ФИО врача": "Белик Анастасия Сергеевна",
                "Адреса": [
                    "40 лет победы 40", "40 лет победы 40а",
                    "братьев кашириных 114", "братьев кашириных 114а",
                    "братьев кашириных 116", "братьев кашириных 118а",
                    "братьев кашириных 118/1", "братьев кашириных 118/2",
                    "братьев кашириных 122", "братьев кашириных 122а",
                    "братьев кашириных 124"
                ]
            }
        }
    },
    "Ньютон, Татищева 256": {
        "Координаты": [55.171313, 61.272711],
        "Заведующий": "Ермакова Олеся Юрьевна",
        "Участки": {
            5: {
                "ФИО врача": "Абдрахманова Валерия Рафаиловна",
                "Адреса": [
                    "250-летия челябинска 29", "250-летия челябинска 31",
                    "250-летия челябинска 33", "250-летия челябинска 42",
                    "250-летия челябинска 44",  # Позже уберём
                    "250-летия челябинска 50", "250-летия челябинска 50а",
                    "героя россии родионова 13", "героя россии родионова 15",
                    "татищева 262", "татищева 264", "татищева 266", "татищева 268"
                ]
            },
            6: {
                "ФИО врача": "Баялиева Ксения Александровна",
                "Адреса": [
                    "академика макеева 24", "академика макеева 26",
                    "героя россии родионова 4", "героя россии родионова 6",
                    "героя россии родионова 20",  # такого дома на карте нет, позже уберем
                    "героя россии родионова 8", "героя россии родионова 10",
                    "героя россии родионова 12", "татищева 256", "татищева 258"
                ]
            },
            7: {
                "ФИО врача": "Иванова Валерия Николаевна",
                "Адреса": [
                    "250-летия челябинска 44а", "250-летия челябинска 48",
                    "академика макеева 20", "героя россии родионова 17", "героя россии родионова 19"
                ]
            },
            8: {
                "ФИО врача": "Гоголина Елизавета Алексеевна",
                "Адреса": [
                    "академика макеева 28", "академика макеева 30",
                    "академика макеева 32", "академика макеева 34", "академика макеева 36",
                    "комсомольский пр 141", "комсомольский пр 143", "комсомольский пр 145", "комсомольский пр 149"
                ]
            }
        }
    },
    "Полянка, 2А": {
        "Координаты": [55.187959, 61.275496],
        "Заведующий": "Аносова Екатерина Константиновна",
        "Участки": {
            9: {
                "ФИО врача": "Усманов Рустам Мухаметович",
                "Адреса": [
                    "40 лет победы 4", "40 лет победы 6", "40 лет победы 8", "40 лет победы 10",
                    "комсомольский пр 100", "комсомольский пр 104", "комсомольский пр 112", "чичерина 5", "чичерина 5в"
                ]
            },
            10: {
                "ФИО врача": "Мезенцева Наталья Владимировна",
                "Адреса": [
                    "салавата юлаева 1", "салавата юлаева 1а", "салавата юлаева 1в",
                    "салавата юлаева 6", "салавата юлаева 8", "салавата юлаева 12",
                    "чичерина 1", "чичерина 2", "чичерина 4а", "чичерина 6"
                ]
            },
            11: {
                "ФИО врача": "Евтушенко Алена Дмитриевна",
                "Адреса": [
                    "бейвеля 1", "бейвеля 3",
                    "звенигородская 54", "звенигородская 56", "звенигородская 56а",
                    "звенигородская 58", "звенигородская 62", "звенигородская 64",
                    "звенигородская 66", "звенигородская 68"
                ]
            },
            12: {
                "ФИО врача": "Конашова Дарья Игоревна",
                "Адреса": [
                    "комсомольский пр 120", "комсомольский пр 122", "комсомольский пр 124",
                    "комсомольский пр 126", "комсомольский пр 128", "комсомольский пр 130",
                    "комсомольский пр 130а", "комсомольский пр 132", "комсомольский пр 132а",
                    "комсомольский пр 134", "комсомольский пр 138", "комсомольский пр 140",
                    "салавата юлаева 3", "салавата юлаева 3а", "салавата юлаева 3в", "чичерина 8"
                ]
            },
            25: {
                "ФИО врача": "Петрова Ирина Витальевна",
                "Адреса": [
                    "салавата юлаева 20", "салавата юлаева 22", "салавата юлаева 24",
                    "салавата юлаева 26", "салавата юлаева 28", "салавата юлаева 30",
                    "салавата юлаева 32", "салавата юлаева 34",
                    "звенигородская 44", "звенигородская 46", "звенигородская 48", "звенигородская 52"
                ]
            }
        }
    },
    "Академика Королева, 15": {
        "Координаты": [55.162679, 61.297235],
        "Заведующий": "Зенкова Людмила Николаевна",
        "Участки": {
            13: {
                "ФИО врача": "Галимьянова Юлия Ришатовна, Кандакова Марьям Юсуповна",
                "Адреса": [
                    "академика королева 4", "академика королева 5", "академика королева 8",
                    "академика королева 14", "академика королева 20", "академика королева 26",
                    "академика королева 28", "академика макеева 7", "академика макеева 11",
                    "братьев кашириных 151", "братьев кашириных 153", "братьев кашириных 157",
                    "братьев кашириных 159", "братьев кашириных 161", "университетская набережная 76",
                    "университетская набережная 80", "университетская набережная 82"
                ]
            },
            14: {
                "ФИО врача": "Радзикевич Александра Сергеевна",
                "Адреса": [
                    "академика королева 40", "академика королева 42", "академика королева 44",
                    "академика королева 48", "академика королева 50", "академика королева 52",
                    "академика макеева 15", "академика макеева 17", "академика макеева 21",
                    "академика макеева 23", "академика макеева 25", "академика макеева 27",
                    "академика макеева 29", "братьев кашириных 152", "братьев кашириных 154",
                    "братьев кашириных 154а", "250-летия челябинска 63", "250-летия челябинска 67",
                    "250-летия челябинска 71", "250-летия челябинска 73"
                ]
            },
            15: {
                "ФИО врача": "Демина Елизавета Витальевна",
                "Адреса": [
                    "академика королева 17", "академика королева 19", "академика королева 21",
                    "академика королева 23", "академика королева 27", "академика королева 27а",
                    "академика королева 38", "академика сахарова 10", "академика сахарова 12",
                    "академика сахарова 14", "академика сахарова 16", "академика сахарова 18",
                    "братьев кашириных 156", "братьев кашириных 156а", "братьев кашириных 158",
                    "братьев кашириных 160", "братьев кашириных 162", "братьев кашириных 163",
                    "братьев кашириных 164", "братьев кашириных 164а", "братьев кашириных 166"
                ]
            },
            16: {
                "ФИО врача": "Чикота Юлия Артемовна",
                "Адреса": [
                    "250-летия челябинска 75", "250-летия челябинска 75а", "250-летия челябинска 77",
                    "250-летия челябинска 79", "академика королева 31", "академика королева 31а",
                    "академика королева 35", "академика королева 35а", "академика королева 37",
                    "академика королева 39", "академика королева 39а", "академика королева 39б",
                    "академика королева 43", "академика королева 45", "академика королева 47",
                    "академика сахарова 20", "академика сахарова 22", "академика сахарова 26",
                    "академика сахарова 28", "академика сахарова 30", "академика сахарова 32",
                    "академика сахарова 34"
                ]
            },
            26: {
                "ФИО врача": "Горохова Анна Александровна",
                "Адреса": [
                    "академика королева 1", "академика королева 7", "академика королева 9",
                    "академика королева 9а", "академика королева 11",
                    "академика сахарова 1", "академика сахарова 2", "академика сахарова 3",
                    "академика сахарова 3а", "академика сахарова 5", "академика сахарова 5а",
                    "академика сахарова 7", "академика сахарова 7а", "академика сахарова 9",
                    "академика сахарова 9а", "академика сахарова 11", "архитектора александрова 2",
                    "архитектора александрова 4", "архитектора александрова 8", "архитектора александрова 10",
                    "университетская набережная 88", "университетская набережная 92",
                    "университетская набережная 94", "университетская набережная 153",
                    "университетская набережная 155", "университетская набережная 159",
                    "пустового 1", "пустового 1а", "пустового 2", "пустового 3", "пустового 3а", "пустового 4",
                    "пустового 5", "пустового 5а", "пустового 5б", "пустового 6",
                    "пустового 7", "пустового 8", "пустового 9", "пустового 10", "пустового 11", "пустового 12",
                    "пустового 13", "пустового 14", "пустового 15", "пустового 16", "пустового 17", "пустового 18",
                    "пустового 19", "пустового 20", "пустового 21", "пустового 22", "пустового 23", "пустового 24",
                    "пустового 25", "пустового 26", "пустового 27", "пустового 28", "пустового 29", "пустового 30",
                    "пустового 31", "пустового 32", "пустового 33", "пустового 34", "пустового 35", "пустового 36",
                    "пустового 37", "пустового 38", "пустового 38а", "пустового 39", "пустового 40", "пустового 41",
                    "пустового 42", "пустового 43", "пустового 44", "пустового 45", "пустового 46", "пустового 47",
                    "пустового 48", "пустового 49", "пустового 50", "пустового 51", "пустового 52", "пустового 53"
                ]
            }
        }
    },
    "Шершни, Заводская, 8 (ФАП)": {
        "Координаты": [55.152794, 61.307512],
        "Заведующий": "Зенкова Людмила Николаевна",
        "Участки": {
            17: {
                "ФИО врача": "Давыдова Валерия Валерьевна",
                "Адреса": [
                    "тарасовка, абрикосовая", "тарасовка, брусничная", "тарасовка, васильковая",
                    "тарасовка, вересковая", "тарасовка, земляничная", "тарасовка, кедровая",
                    "тарасовка, кленовая", "тарасовка, клубничная", "тарасовка, липовая",
                    "тарасовка, малахитовая", "тарасовка, медовая", "тарасовка, нектарная",
                    "тарасовка, ореховый переулок", "тарасовка, песочная", "тарасовка, пчелиная",
                    "тарасовка, раздольная", "тарасовка, рассветная", "тарасовка, соловьиная",
                    "тарасовка, тюльпанная", "тарасовка, усадебная",
                    "карпов пруд, агатовая", "карпов пруд, аквамариновая", "карпов пруд, аркаимская",
                    "карпов пруд, бирюзовая", "карпов пруд, великопетровская", "карпов пруд, вятская",
                    "карпов пруд, гиацинтовая", "карпов пруд, заповедная", "карпов пруд, ивовая",
                    "карпов пруд, каргопольская", "карпов пруд, карповая", "карпов пруд, коломенская",
                    "карпов пруд, кунгурская", "карпов пруд, лазуритовая", "карпов пруд, ландышевая",
                    "карпов пруд, невская", "карпов пруд, нефритовая", "карпов пруд, ольховая",
                    "карпов пруд, пихтовая", "карпов пруд, ромашковая", "карпов пруд, рубиновая",
                    "карпов пруд, снежинская", "карпов пруд, фиалковая", "карпов пруд, фруктовая",
                    "карпов пруд, холмогорская",
                    "шершни, веселая", "шершни, гидрострой", "шершни, заводская",
                    "шершни, западная", "шершни, ключевая", "шершни, ленина",
                    "шершни, михайловская", "шершни, парковая", "шершни, покровская",
                    "шершни, пролетарская", "шершни, рабоче-колхозная", "шершни, радужная",
                    "шершни, садовая", "шершни, свободы", "шершни, северная",
                    "шершни, советская", "шершни, совхозная", "шершни, степная",
                    "шершни, трактовая", "шершни, тополиная", "шершни, центральная",
                    "шершни, ягодная", "шершни, янтарная", "шершни, шуйская",
                    "теннисная 4а", "татищева 8", "татищева 10", "татищева 12", "татищева 15", "татищева 16",
                    "татищева 21", "татищева 23", "татищева 25", "татищева 27", "татищева 31",
                    "татищева 37", "татищева 42", "татищева 48", "татищева 50"
                ]
            }
        }
    },
    "40 лет Победы, 52": {
        "Координаты": [55.174090, 61.314177],
        "Заведующий": "Бочкарева Татьяна Николаевна",
        "Участки": {
            18: {
                "ФИО врача": "Кручева Альбина Тагировна",
                "Адреса": [
                    "братьев кашириных 109", "братьев кашириных 111",
                    "братьев кашириных 111б", "братьев кашириных 113", "братьев кашириных 115", "братьев кашириных 117",
                    "братьев кашириных 119", "братьев кашириных 121", "молодогвардейцев 74", "молодогвардейцев 76",
                    "наркома малышева 3", "наркома малышева 8", "университетская набережная 44",
                    "университетская набережная 46", "университетская набережная 48"
                ]
            },
            19: {
                "ФИО врача": "Колпащикова Лариса Александровна",
                "Адреса": [
                    "40 лет победы 44", "40 лет победы 52", "40 лет победы 53", "40 лет победы 55", "40 лет победы 57",
                    "40 лет победы 59", "40 лет победы 61", "40 лет победы 63", "братьев кашириных 127",
                    "братьев кашириных 127а", "братьев кашириных 131", "братьев кашириных 131а",
                    "братьев кашириных 131б", "университетская набережная 52",
                    "университетская набережная 54", "университетская набережная 56"
                ]
            },
            20: {
                "ФИО врача": "Рафалович Алина Игоревна",
                "Адреса": [
                    "чичерина 43", "чичерина 45", "чичерина 47", "университетская набережная 59",
                    "университетская набережная 60", "университетская набережная 61", "университетская набережная 62",
                    "университетская набережная 63", "университетская набережная 64",
                    "университетская набережная 83", "университетская набережная 85", "университетская набережная 97",
                    "университетская набережная 97а", "университетская набережная 99", "университетская набережная 103",
                    "университетская набережная 105", "университетская набережная 107", "университетская набережная 109"
                ]
            }
        }
    },
    "Привилегия, Спортивная, 13": {
        "Координаты": [55.112329, 61.252436],
        "Заведующий": "Не указан",
        "Участки": {
            23: {
                "ФИО врача": "Дмитриенко Анастасия Николаевна",
                "Адреса": [
                    "западный, вишневая горка, вишневая аллея",
                    "западный, вишневая горка, генерала костицына",
                    "западный, вишневая горка, изумрудная",
                    "западный, вишневая горка, олимпийская",
                    "западный, залесье, раздольная",
                    "западный, залесье, радужная",
                    "западный, залесье, прохладная",
                    "западный, залесье, лесная",
                    "западный, залесье, отрадная",
                    "западный, залесье, заповедная",
                    "западный, залесье, еловая",
                    "западный, залесье, правобережная",
                    "западный, белый хутор, брусничная",
                    "западный, белый хутор, международная",
                    "западный, белый хутор, мира",
                    "западный, белый хутор, содружества",
                    "западный, белый хутор, светлая",
                    "западный, белый хутор, лазурная",
                    "западный, белый хутор, береговая",
                    "западный, просторы, просторная",
                    "западный, привилегия, уютная", "западный, привилегия, цветной бульвар",
                    "западный, привилегия, академическая", "западный, привилегия, спортивная",
                    "западный, западный город, пролетарская", "западный, западный город, заозерная",
                    "западный, западный город, карнавальная", "западный, западный город, триумфальная",
                    "западный, западный город, дубравная",
                    "западный, женева, клубная", "западный, женева, альпийская", "западный, женева, млечная",
                    "западный, женева, светлая", "западный, женева, стартовая", "западный, женева, каштановый переулок",
                    "западный, женева, озерный переулок", "западный, женева, женевский бульвар",
                    "западный, женева, европейский переулок",
                    "западный, западные луга, звездная", "западный, западные луга, раздольная",
                    "западный, западные луга, радужная", "западный, западные луга, главная",
                    "западный, западные луга, благодатная", "западный, западные луга, рассветная",
                    "западный, западные луга, весенняя", "западный, западные луга, западная",
                    "западный, западные луга, луговая", "западный, западные луга, полянка",
                    "западный, западные холмы, родниковая", "западный, западные холмы, кедровая",
                    "западный, западные холмы, березовая", "западный, западные холмы, кленовая",
                    "западный, западные холмы, белая акация", "западный, западные холмы, цветочный бульвар",
                    "западный, западные холмы, сиреневый переулок", "западный, западные холмы, сиреневая",
                    "западный, холмс, лондонская", "западный, холмс, петербургская", "западный, холмс, женевская",
                    "западный, холмс, пражская", "западный, холмс, венская", "западный, холмс, парижский бульвар",
                    "западный, конфетти, дружбы",
                    "малиновка, лесной остров, лесопарковая",
                    "малиновка, лесной остров, осенний бульвар",
                    "малиновка, лесной остров, пражская набережная",
                    "малиновка, лесной остров, благодатный переулок",
                    "малиновка, лесной остров, легендарная",
                    "малиновка, лесной остров, спортивный переулок",
                    "малиновка, лесной остров, уютный переулок",
                    "малиновка, лесной остров, западная",
                    "малиновка, лесной остров, живописная",
                    "малиновка, лесной остров, панорамная",
                    "малиновка, лесной остров, светлый",
                    "малиновка, лесной остров, возвышенная",
                    "малиновка, лесной остров, родной переулок",
                    "малиновка, лесной остров, весенняя",
                    "малиновка, лесной остров, ласковый переулок",
                    "малиновка, лесной остров, градостроителей",
                    "малиновка, лесной остров, историческая",
                    "малиновка, лесной остров, мечтателей",
                    "малиновка, лесной остров, малиновая горка",
                    "малиновка, лесной остров, яркий переулок",
                    "малиновка, лесной остров, пейзажная",
                    "малиновка, лесной остров, тенистый переулок",
                    "малиновка, лесной остров, олимпийская",
                    "малиновка, лесной остров, добрый переулок",
                    "малиновка, лесной остров, энтузиастов переулок",
                    "малиновка, лесной остров, осенний бульвар",
                    "малиновка, лесной остров, видный переулок",
                    "малиновка, колющенко, центральная",
                    "малиновка, колющенко, рождественская",
                    "малиновка, колющенко, лучистая",
                    "малиновка, колющенко, нагорная",
                    "малиновка, колющенко, нагорный переулок",
                    "малиновка, колющенко, олимпийская",
                    "малиновка, колющенко, хвойная",
                    "малиновка, колющенко, ботаническая",
                    "малиновка, колющенко, юбилейная",
                    "малиновка, колющенко, верхний переулок",
                    "малиновка, колющенко, западная",
                    "малиновка, колющенко, красных зорь",
                    "малиновка, колющенко, красная",
                    "малиновка, колющенко, загородная",
                    "малиновка, полет, лесная",
                    "малиновка, полет, сиреневая",
                    "малиновка, полет, северная",
                    "малиновка, полет, цветочная",
                    "малиновка, полет, березовая",
                    "малиновка, полет, спортивная",
                    "малиновка, полет, солнечная",
                    "малиновка, полет, ягодная",
                    "малиновка, полет, сосновая",
                    "малиновка, полет, ягодный переулок",
                    "малиновка, полет, клубная",
                    "малиновка, полет, торговая",
                    "кременкуль, зеленый мыс, вербный переулок",
                    "кременкуль, зеленый мыс, лучистый переулок",
                    "кременкуль, зеленый мыс, цветочный переулок",
                    "кременкуль, зеленый мыс, главная",
                    "кременкуль, зеленый мыс, летняя",
                    "кременкуль, зеленый мыс, новая",
                    "кременкуль, зеленый мыс, плодовая",
                    "кременкуль, зеленый мыс, спортивная",
                    "кременкуль, зеленый мыс, тепличная",
                    "кременкуль, зеленый мыс, тихая",
                    "кременкуль, зеленый мыс, южная",
                    "малиновка, №4, новая пикадилли",
                    "малиновка, №4, коко шанель",
                    "малиновка, №4, антонио гауди",
                    "малиновка, №4, федерико феллини",
                    "малиновка, №4, ивана айвазовского",
                    "малиновка, №4, марка шагала",
                    "малиновка, №4, энцо феррари",
                    "малиновка, №4, джазовая",
                    "малиновка, №4, варфоломея растрелли",
                    "малиновка, №4, любови орловой",
                    "малиновка, №4, бульварный проезд",
                    "малиновка, №2б, радужная",
                    "малиновка, №2б, каштановая",
                    "малиновка, урал-терра, ивовая"
                ]
            }
        }
    },
}
