# Не более 64 символа. Название бота
bot_name = "Полимедика - универсальный помощник"

# Не более 512 символов. Описание, которое показывается в боте, когда диалог пустой
bot_description = ("Полимедика ─ это федеральная сеть поликлиник, оказывающих помощь в системе ОМС.\n\n"
                   "Предоставляем весь объем первичной медицинской помощи для взрослых и детей, создавая комфортные "
                   "условия для пребывания в наших клиниках.\n\nНаша задача — помочь пациентам вернуть и сохранить "
                   "здоровье, решить проблемы без очередей и бюрократии.")

# Не более 120 символов. Описание в профиле бота
bot_short_description = ("Бот-помощник для пациентов Полимедики в г. Челябинск\n\nТелефон для записи: "
                         "+73512409977\nСайт: mnogomed.ru/chelyabinsk")
